#字典嵌套使用
dict_travel={
    "聊城":{
        "景区":["东昌湖","景阳冈","光岳楼","东阿","孔繁森纪念馆","运河博物馆"],
        "高中":["聊城一中","聊城二中","聊城三中","聊城四中"],
        "美食":["武大郎烧饼","高汤老豆腐","烤鸡"]
        },
    "上海":{
        "景区":["嘉定公园","迪士尼乐园","陆家嘴","外冈镇","熊猫动物园"],
        "美食":["烤苕皮","挑凉菜","大混沌","麻辣烫","CoCo奶茶"]
        }
    }
print(dict_travel["上海"]["美食"])

#获取聊城 所有的活动
list_dict = list(dict_travel.get("聊城").keys())
print(list_dict)


#获取聊城市所有的热点个数


num = 0

for i in list(dict_travel.get("聊城").values()):
    num += len(i)
print(num)
